import random
from enum import Enum


class D(Enum):
    @classmethod
    def choice(cls) -> str:
        return random.choice(list(cls)).value


class D0(D):
    M0 = "大……成功!?咿呀呀！meki知道错了！meki会道歉的！不要欺负meki酱……对不起对不起对不起……"
    M1 = "这……不可能……大成功什么的，都……都是meki不好！求求原谅meki，meki再也不敢挑衅大哥哥了……"


class D1(D):
    M0 = "明明只是杂鱼大哥哥请不要觉得自己极难成功就得意……啊，不是……meki不是在挑衅大哥哥……呐呐……不要当真嘛……"
    M1 = "切，居然是极难成功，这样子的事……meki可没听说过会这样子啊……"


class D2(D):
    M0 = "不……不过是困难成功而已，不要高兴得太早，撞狗屎运就觉得自己赢过了meki酱还真是符合大哥哥那单细胞一般的大脑呢❤~~"
    M1 = "别……别太得意，着肯定是多亏了meki才能困难成功吧，杂鱼说白了也还是一只杂鱼❤~~"


class D3(D):
    M0 = "普通成功而已就高兴成那样，大哥哥可真没见过世面❤~~，不过对于大哥哥杂鱼般的运气来说或许也能算好运了呢❤~~"
    M1 = "欸❤~~普通成功了吗~~？说到底大哥哥也只能做到这种程度了吧~~"


class D4(D):
    M0 = "大哥哥又失败了呢❤~~要meki酱帮帮废材大哥哥吗？欸~~，要不要呢❤~~？"
    M1 = "哈~？说真的大哥哥很恶心耶？失败了就赶紧像败家之犬一样灰溜溜地回去吧~~？嘻嘻❤~~"
    M3 = "失败，还是失败~~好弱的大人❤~~meki长大以后可不要变成这样子呢❤~~"


class D5(D):
    M0 = "大失败~大失败~怪蜀黍大失败❤~~杂鱼一样的运气什么都做不好~嘻嘻❤~~。"
    M1 = "杂鱼~杂鱼~投个骰子都要大失败的杂鱼❤~~还是回到妈妈的肚子里重新来过吧~"
    M3 = "欸❤~~每次都大失败的废材大哥哥在这个世界上还有存在价值吗~？说不定重新投胎比较好呢~？"


class D6(D):
    M0 = "大哥哥终于成功了~~真是不容易呢❤~~这可多亏了我才能成功，可要好好记住meki大人的恩惠哦~~"
    M1 = "这是当然，meki大人我亲自来帮你，你知道多少人能够享受到这样子的待遇吗❤~~？你可要好好地将meki的善良刻在脑海里哦❤~~"


class D7(D):
    M0 = "咦……咦……能差劲成这样子，杂鱼❤~~废材❤~~就算是meki也不想给大哥哥任何帮助呢~~"
    M1 = "果然杂鱼大哥哥的价值就连鸿毛都不如呢❤~~果然还是让大哥哥一个人自生自灭吧~~"


class D8(D):
    M0 = "还不快感谢本大人，如果没有meki的话❤~~大哥哥都不知道现在是什么样了呢。"
    M1 = "心怀歉意的感谢本meki吧，要不然把meki当作圣女遵奉也不是不可以哦❤~~meki可是救大哥哥一条命呢❤~~"


class D9(D):
    M0 = "大哥哥想逃吗~~?想meki救救你吗❤~~？嘻嘻~~哈哈~~本meki怎么会听杂鱼的废话？才不会救你呢❤~~大哥哥还是赶快自生自灭吧~~"
    M1 = "嘻嘻❤~~废柴大哥哥果然没救了呢~~想要meki大人救救你吗~~？欸~~？大哥哥到底在说什么呀？meki听不见呢❤~~？"
